In [1]:
import numpy as np
import pandas as pd

## 누락된 데이터 처리

In [2]:
a = np.array([4, 2, np.nan, 5])

In [3]:
a.dtype

dtype('float64')

In [4]:
type(np.nan)

float

In [5]:
np.sum(a)  # nan이 있으면 값을 오염시킴 => 그래서 합계가 나오지 못함

nan

In [6]:
np.nansum(a) # nan을 제외하고 나머지 값을 구하겠다

11.0

### 널 값 연산하기

In [7]:
df = pd.DataFrame([[1,2], [3,np.nan]], columns = ['x','y'])  
#대괄호 2개 쓰면 2차원  #DataFrame은 index에 일련번호 이외의 값을 줄 수 있음. 칼럼 번호 대신 이름 넣을 수 있음

In [8]:
df

   x    y
0  1  2.0
1  3  NaN

In [9]:
df.isnull()  #널 값 탐지하기  #널이면 true

       x      y
0  False  False
1  False   True

In [10]:
df.notnull() #널이 아니면 true

      x      y
0  True   True
1  True  False

In [11]:
df.dropna()  #널 값을 없앤다  # NaN이 있는 모든 행을 삭제

   x    y
0  1  2.0

In [12]:
df.dropna(axis = 1) # NaN이 있는 모든 열을 삭제

   x
0  1
1  3

In [13]:
df.fillna(0)  # 데이터를 삭제하는 대신에 특정한 값을 채움

   x    y
0  1  2.0
1  3  0.0

## 타이타닉 데이터 분석

In [15]:
titanic = pd.read_csv('titanic.csv')

In [16]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
titanic.describe()  #수치형 컬럼에 대한 요약 통계량

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [19]:
titanic.Survived.unique()  #값의 종류가 몇가지가 있는지 알고싶으면 => unique

array([0, 1], dtype=int64)

In [20]:
titanic.Name.unique().shape  #서로 다른 이름의 갯수가 몇 개인지

(891,)

In [21]:
titanic['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [22]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [23]:
titanic.Cabin.isnull()

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Cabin, Length: 891, dtype: bool

In [24]:
titanic.Cabin.isnull().sum()

687

In [25]:
titanic.dropna().shape   # 결측값이 있는 데이터를 버리고 난 후 갯수

(183, 12)

In [26]:
titanic2 = titanic.drop(['Cabin'], axis = 1) # Cabin은 열이라 axis 해줘야함

In [27]:
titanic2.shape

(891, 11)

In [28]:
titanic2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [29]:
titanic3 = titanic2.dropna()

In [30]:
titanic3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  712 non-null    int64
 1   Survived     712 non-null    int64
 2   Pclass       712 non-null    int64
 3   Name         712 non-null    object
 4   Sex          712 non-null    object
 5   Age          712 non-null    float64
 6   SibSp        712 non-null    int64
 7   Parch        712 non-null    int64
 8   Ticket       712 non-null    object
 9   Fare         712 non-null    float64
 10  Embarked     712 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 66.8+ KB

## 데이터셋 결합

### 행 결합

In [31]:
df1 = pd.DataFrame({'A' : [1,2,3]}) # dictionary의 key = Column 이름, Value = 해당 Column의 Data
                                    # {} = dictionary , '' = key, [] = value

In [32]:
df1

   A
0  1
1  2
2  3

In [33]:
df1 = pd.DataFrame({'A' : [1,2,3], 'B':[4,5,6]})

In [34]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [35]:
df2 = pd.DataFrame({'A':[10,20], 'B':[40,55]}, index = [5,9])

In [36]:
df2

    A   B
5  10  40
9  20  55

In [37]:
pd.concat([df1,df2]) # df1 과 df2 열로 연결

    A   B
0   1   4
1   2   5
2   3   6
5  10  40
9  20  55

### 열 결합

In [38]:
df3 = pd.DataFrame({'C' : [5,2,8], 'D':[10,50,-2]})

In [39]:
df3

   C   D
0  5  10
1  2  50
2  8  -2

In [40]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [41]:
pd.concat([df1, df3], axis = 1) # 행으로 결합은 axis

   A  B  C   D
0  1  4  5  10
1  2  5  2  50
2  3  6  8  -2

### 결합할 때 맞지 않는 경우

In [42]:
df4 = df3.loc[0:1, :] # df3에 0번부터 1번까지 값 가져오기

In [43]:
df4

   C   D
0  5  10
1  2  50

In [44]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [46]:
pd.concat([df1, df4], axis = 1)  #외부조인 형태와 유사  #외부조인(합집합) <=> join = 'outer'

   A  B    C     D
0  1  4  5.0  10.0
1  2  5  2.0  50.0
2  3  6  NaN   NaN

In [47]:
pd.concat([df1, df4], axis = 1, join = 'inner') #내부조인(교집합)

   A  B  C   D
0  1  4  5  10
1  2  5  2  50

### pd.merge() 조인

In [48]:
dept = pd.DataFrame({'name':['강','박','이','최'], 'dep':['컴공','컴공','통계','소융']})

In [49]:
dept

  name dep
0    강  컴공
1    박  컴공
2    이  통계
3    최  소융

In [50]:
year = pd.DataFrame({'name':['이','최','강'], 'year':[2018, 2016, 2017]})

In [51]:
year

  name  year
0    이  2018
1    최  2016
2    강  2017

In [52]:
pd.merge(dept, year)

  name dep  year
0    강  컴공  2017
1    이  통계  2018
2    최  소융  2016

In [53]:
pd.merge(dept, year, on='name') #내부 조인

  name dep  year
0    강  컴공  2017
1    이  통계  2018
2    최  소융  2016

In [55]:
pd.merge(dept, year, how = 'outer')

  name dep    year
0    강  컴공  2017.0
1    박  컴공     NaN
2    이  통계  2018.0
3    최  소융  2016.0

In [56]:
dept = pd.DataFrame({'name':['강','박','이','최'], 'dep':['컴공','컴공','통계','소융']})

In [58]:
year2 = pd.DataFrame({'student':['이','최','강'], 'year':[2018, 2016, 2017]})

In [59]:
pd.merge(dept, year2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [60]:
pd.merge(dept, year2, left_on='name', right_on='student')

  name dep student  year
0    강  컴공       강  2017
1    이  통계       이  2018
2    최  소융       최  2016

In [62]:
pd.merge(dept, year2, left_on='name', right_on='student').drop('student', axis = 1)  #이름 중복을 하나로 합치기(지우기)

  name dep  year
0    강  컴공  2017
1    이  통계  2018
2    최  소융  2016